
namespace JDH.Chapter1.Home;

class AfterDreamDialogue : DialogueResource
{
    private void Init()
    {
        Id("jdh:after_dream");
        Start(DreamStart);

        Alias("john", "jdh:john",
            display: "Лололошка",
            nameColor: nameColor("#FC9004"),
            visual: SkinHead("echo_content_player:player/base"));

        Alias("sasha", "jdh:sasha",
            display: "Сестрёнка",
            visual: SkinHead("jdh:sasha"));

        Alias("father", "jdh:john_father",
            display: "Отец",
            visual: SkinHead("jdh:john_father"));
    }

    private void DreamStart()
    {
        Line("john", "Опять этот сон... Сколько они меня уже драконят... пару недель?");
        Line("john", "Списать на случайность при таком раскладе не вариант...");

        Line("john", "Чёрт... Ещё и проснулся из-за него раньше времени...");
        Line("john", "До пар ещё несколько часов...");

        Line("john", "Так оставлять нельзя, а то совсем высыпаться перестану.");
        Line("john", "Нужно разобраться, почему мой собственный мозг вдруг решил поиздеваться надо мной.");

        Sound.Play("jdh:door_knock");

        Line("sasha", "Лололошка? Ты что, проснулся? Всё хорошо?");

        Line("john", "Доброе утро, Саш. Не переживай.");
        Line("john", "Просто сон дурацкий приснился, вот и проснулся. Можешь заходить.");

        // TODO: Дверь открывается, Саша входит.

        Line("sasha", "А знаешь, я рада, что ты проснулся.");
        Line("sasha", "Ты обычно спишь в это время, а я ведь скучаю.");

        Line("john", "В таком случае тебе крупно повезло, ведь я...");
        Line("john", "Погоди, а почему ты раньше мне не говорила, что скучаешь по утрам?");

        Line("sasha", "Так я же крутая сестра!");
        Line("sasha", "Знаю, что учёба в университете — это тяжело.");
        Line("sasha", "Понимаю, что тебе нужно когда-то отдыхать и высыпаться.");

        Line("sasha", "Как ты там говорил... Сон важен для психического здоровья.");
        Line("sasha", "Он обеспечивает эмоциональную стабильность, улучшает кон... когн...");

        Line("john", "Хе-хе, когнитивные функции и помогает перерабатывать стресс.");
        Line("john", "Крутая сестрёнка, ни добавить ни убавить.");

        Line("sasha", "Блин, жаль, мне скоро в школу...");
        Line("sasha", "Но, если хочешь, можешь присоединиться к семейному завтраку.");

        Line("john", "Семейный завтрак?");

        Line("sasha", "Ну, я каждое утро готовлю... расставляю посуду... зову отца...");
        Line("sasha", "Раз уж ты проснулся, он действительно будет семейным: 3");

        Line("john", "Ну я-то понятно, а отец какое отношение к семье имеет?");

        Line("sasha", "Ло! Ему просто очень тяжело после того, как мама...");

        // TODO: Джон перебивает Сашу.

        Line("john", "Всем тяжело, Саш.");
        Line("john", "Только вот мы учимся жить дальше, в то время как отец свёл свои жизненные процессы до уровня амёбы.");
        Line("john", "И занял позицию жертвы.");

        Line("sasha", "Блин, Лололошка, неужели так тяжело проявить хоть капельку сострадания к нему?");
        Line("sasha", "Ему ведь нужна помощь!");

        Choice(
            "agree",
            "Эх, ну ты же меня знаешь, не могу тебе отказать, когда ты смотришь на меня своими щенячьими глазками.",
            Agree
        );

        Choice(
            "decline",
            "Слышала поговорку? Один раз — случайность, два — совпадение, три — закономерность.",
            Decline
        );
    }

    private void Agree()
    {
        Line("john", "Ладно, давай подыграю.");
        Line("john", "Но учти, когда он опять...");

        Line("sasha", "А вдруг всё будет хорошо?");
        Line("sasha", "Я сегодня сделала вкусные блинчики по маминому рецепту из книги.");
        Line("sasha", "Может, они его смогут подбодрить?");

        Line("john", "Я почему-то ставлю на твои блинчики больше, чем на мой научный подход)");

        Line("sasha", "Ха-ха-ха, да ну?");
        Line("sasha", "Ну тогда пойдём скорее!");

        Dialogue.GoTo(FamilyBreakfast);
    }

    private void Decline()
    {
        Line("john", "Ты думаешь, я не пытался ему помочь?");
        Line("john", "Он просто закрывается в себе и даже слушать не хочет.");
        Line("john", "Начинает проявлять агрессию...");
        Line("john", "Поэтому я предпочитаю его вообще не трогать.");

        Line("sasha", "Ло, если не пытаться что-то изменить, то ничего и не поменяется!");

        Line("sasha", "Сегодня, например, у меня есть туз в рукаве!");
        Line("sasha", "Я сделала вкусные блинчики по маминому рецепту из книги.");
        Line("sasha", "Может, они смогут его подбодрить?");

        Line("john", "Знаешь, после того как он проиграл моё имя в карты...");
        Line("john", "Я уже ни в чём не уверен...");

        Line("sasha", "Ну пожа-а-а-а-а-а-а-алуйста!");

        Line("john", "Эх, ну ты же знаешь, я не могу тебе отказать.");
        Line("john", "Когда ты смотришь на меня своими щенячьими глазками...");
        Line("john", "Я помогу чем смогу, но учти, когда он опять...");

        Line("sasha", "А вдруг всё будет хорошо?");
        Line("sasha", "Я сегодня сделала вкусные блинчики по маминому рецепту.");
        Line("sasha", "Может, они его смогут подбодрить?");

        Line("john", "Я почему-то ставлю на твои блинчики больше, чем на мой научный подход)");

        Line("sasha", "Ха-ха-ха, да ну?");
        Line("sasha", "Ну тогда пойдём скорее!");

        Dialogue.GoTo(FamilyBreakfast);
    }

    private void FamilyBreakfast()
    {
        // TODO: Перемещение Джона и Саши на кухню.
        // TODO: Отец сидит за столом.

        Line("sasha", "Доброе утро, пап!");

        // Отец молчит.

        Line("sasha", "Я говорю, доброе утро!");

        Line("father", "Я и с первого раза услышал...");

        // TODO: Саша начинает переживать.

        // TODO: Джон шепчет Саше.
        Line("john", "Как хорошо, что мы не унаследовали от него эту черту характера.");

        // TODO: Саша тихонько смеётся.

        Line("john", "Между прочим, моя крутая сестрёнка приготовила для нас сюрприз на завтрак.");

        // Отец игнорирует слова Джона.

        Line("john", "Впрочем, чего ещё я мог от него ожидать...", thought: true);

        Line("john", "Ну а кто говорил, что будет легко?");
        Line("john", "Давай, Саш, неси!");

        Line("sasha", "Секундочку!");

        Complete("jdh:after_dream_breakfast_done");
    }
}
